### Librer√≠as necesarias

In [97]:
import psycopg2
import numpy as np
import pandas as pd
import os
import urllib.parse as up
from sqlalchemy import create_engine
import warnings
warnings.filterwarnings('ignore')

### Conexi√≥n a ElephantSQL

In [130]:
up.uses_netloc.append("nombre_instancia")
url = "postgresql://nombre_bbdd:tu_password@baasu.db.elephantsql.com/nombre_bbdd"

conn = psycopg2.connect(url)
crsr = conn.cursor()
engine = create_engine(url)

### Agregar datos a las tablas

In [99]:
hierarchy = pd.read_csv("./archivos_csv/hierarchy.csv")

In [100]:
hierarchy.to_sql(name="hierarchy", con=engine, if_exists="append", index=False)

64

In [101]:
# conn.commit()

In [102]:
product = pd.read_csv("./archivos_csv/product.csv")
product

                id                      name  net_price hierarchy_id
0             9050    Hamburguesa Americanaü•ì     6990.0       AB.410
1    TOTEATDVYCOST            Costo Delivery     3213.0          AB.
2             1090               Mexa Grande     5990.0       AB.010
3             1050   Cheese and bacon Grande     5990.0       AB.010
4             1920    Pollo albahaca grande      5990.0       AB.010
..             ...                       ...        ...          ...
569           7561              tropical gin     8990.0       AB.007
570           4870           corta corriente     8990.0       AB.007
571           4880                 piscolas      5990.0       AB.007
572           4890                golden ale     7990.0       AB.007
573           2815  Bombay saphire gin 750ml     6490.0       AB.090

[574 rows x 4 columns]

In [103]:
product.to_sql(name="products", con=engine, if_exists="append", index=False)

574

In [104]:
# conn.commit()

In [105]:
payment_form_type = pd.read_csv("./archivos_csv/tipos_forma_pago.csv")
payment_form_type

       id                name
0    5000             Web Pay
1   50002  PedidosYa Efectivo
2    1000            Efectivo
3   50004           Uber eats
4    3000      Tarjeta D√©bito
5    9001       Transferencia
6    5013  PedidosYa Vouchers
7    5012           PedidosYa
8    5015               Rappi
9    5103            UberEats
10   2000     Tarjeta Cr√©dito
11   5119              Mercat

In [106]:
payment_form_type.to_sql(name="payment_form_type", con=engine, if_exists="append", index=False)

12

In [107]:
# conn.commit()

In [108]:
tables = pd.read_csv("./archivos_csv/mesas.csv")
tables

          id     name  capacity
0    V-90002  Virtual         0
1         18      T16         4
2          7       T7         4
3         16      T14         4
4          3       T3         4
..       ...      ...       ...
206       45     AF12         4
207       49     AF16         4
208       46     AF13         4
209       47     AF14         4
210       48     AF15         4

[211 rows x 3 columns]

In [109]:
tables.to_sql(name="tables", con=engine, if_exists="append", index=False)

211

In [110]:
# conn.commit()

In [111]:
waiters = pd.read_csv("./archivos_csv/meseros.csv")
waiters

                  id                    name
0                  0         Sin Especificar
1                  3         Pedro Rodriguez
2                  1          Leslie Canel√≥n
3                 20                   Frank
4   6649939665616896         Sin Especificar
5   5133770745970688         Sin Especificar
6   6406847628574720         Sin Especificar
7   6301468951576576         Sin Especificar
8   6312141743980544         Sin Especificar
9   5140254229790720         Sin Especificar
10                11  Perfil CAJA La Florida
11                17                  prueba
12  6453940423753728         Sin Especificar
13  6487099324497920         Sin Especificar
14                16           Adriana Mu√±oz
15                18          David Sifontes
16                19             Ronny Vegas
17                21          Bruno Castillo
18                22      Getsemani Graterol

In [112]:
waiters.to_sql(name="waiters", con=engine, if_exists="append", index=False)

19

In [113]:
# conn.commit()

In [76]:
ventas_total = pd.read_csv("./archivos_csv/ventas_total.csv")
ventas_total

,id,total,gratuity,discounts,taxes,subtotal,payed,table_id,waiter_id,date_open,date_closed
0,4617000165572608,6990.0,0.0,0.0,1629.0,5361.0,10203.0,V-90002,0,2021-08-14T00:55:44,2021-08-14T01:50:47
1,4878437089804288,17970.0,0.0,0.0,2868.0,15102.0,17970.0,18,3,2021-08-14T01:26:35,2021-08-14T20:23:29
2,5124727694426112,6990.0,0.0,0.0,1116.0,5874.0,6990.0,7,3,2021-08-14T01:33:55,2021-08-14T01:42:23
3,5246704765632512,19980.0,0.0,-3700.0,2599.0,17381.0,16280.0,16,3,2021-08-13T21:10:13,2021-08-13T21:26:44
4,5308026161201152,12880.0,0.0,0.0,2056.0,10824.0,12880.0,3,3,2021-08-13T22:25:19,2021-08-14T00:04:35
...,...,...,...,...,...,...,...,...,...,...,...
53599,6643010967306240,54930.0,5493.0,0.0,8769.0,46161.0,60423.0,39,19,2024-02-10T23:27:32,2024-02-11T05:34:53
53600,6683520360644608,86780.0,8678.0,0.0,13855.0,72925.0,95458.0,36,19,2024-02-11T02:59:49,2024-02-11T05:36:28
53601,6739510057631744,26170.0,2617.0,0.0,4178.0,21992.0,28787.0,10,19,2024-02-11T02:13:53,2024-02-11T05:27:24
53602,6740702414372864,21990.0,0.0,0.0,3511.0,18479.0,21990.0,V-90014,0,2024-02-11T01:52:18,2024-02-11T01:57:04
53603,6750384411508736,26370.0,2636.0,0.0,4210.0,22160.0,29006.0,34,16,2024-02-11T02:33:48,2024-02-11T03:36:22

In [114]:
ventas_total['id'].nunique()

53380

In [115]:
# ventas_total tiene id's repetidos, lo que es un error. En este caso los eliminamos
ventas_total.drop_duplicates(subset=['id'], inplace=True)
ventas_total.shape

(53380, 11)

In [116]:
ventas_total.to_sql(name="ventas_total", con=engine, if_exists="append", index=False)

380

In [117]:
# conn.commit()

In [118]:
payments_forms = pd.read_csv("./archivos_csv/forma_pago.csv")
payments_forms

               order_id  payment_id   amount
0      4617000165572608        5000  10203.0
1      4878437089804288       50002  17970.0
2      5124727694426112        1000   6990.0
3      5246704765632512       50004  16280.0
4      5308026161201152        1000  12880.0
...                 ...         ...      ...
54953  6683520360644608        3000  95458.0
54954  6739510057631744        1000  28787.0
54955  6740702414372864        5103  21990.0
54956  6750384411508736        3000  14503.0
54957  6750384411508736        3000  14503.0

[54958 rows x 3 columns]

In [133]:
payments_forms.to_sql(name="payment_forms", con=engine, if_exists="append", index=False)

958

In [134]:
# conn.commit()

In [126]:
ventas_x_products = pd.read_csv("./archivos_csv/ventasxproducts.csv")
ventas_x_products

                order_id     product_id  quantity    payed   taxes  discounts
0       4617000165572608           9050         1   6990.0  1116.0        0.0
1       4617000165572608  TOTEATDVYCOST         1   3213.0   513.0        0.0
2       4878437089804288           1090         1   5990.0   956.0        0.0
3       4878437089804288           1050         1   5990.0   956.0        0.0
4       4878437089804288           1920         1   5990.0   956.0        0.0
...                  ...            ...       ...      ...     ...        ...
224117  6740702414372864           2340         1      0.0     0.0        0.0
224118  6750384411508736           3480         1      0.0     0.0        0.0
224119  6750384411508736           7450         2  13380.0  2136.0        0.0
224120  6750384411508736           4370         1      0.0     0.0        0.0
224121  6750384411508736           7670         1  12990.0  2074.0        0.0

[224122 rows x 6 columns]

In [127]:
ventas_x_products.to_sql(name="ventas_x_products", con=engine, if_exists="append", index=False)

122

### Guardar cambios

In [128]:
conn.commit()

### Cerrar conexi√≥n

In [135]:
conn.close()